xml4test/54654.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><S:Header><wsse:Security S:actor="http://smev.gosuslugi.ru/actors/smev"><ds:Signature><ds:KeyInfo><wsse:SecurityTokenReference><wsse:Reference URI="#SenderCertificate"/></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="SenderCertificate"/></wsse:Security></S:Header><S:Body wsu:Id="body"><smev:Message xmlns="http://smev.gosuslugi.ru/rev111111" xmlns:smev="http://smev.gosuslugi.ru/rev111111"><smev:Sender><smev:Code>981601</smev:Code><smev:Name>Сухоруков Дмитрий Владимирович</smev:Name></smev:Sender><smev:Recipient><smev:Code>FMS001001</smev:Code><smev:Name>ФМС России</smev:Name></smev:Recipient><smev:Originator><smev:Code>981601</smev:Code><smev:Name>Сухоруков Дмитрий Владимирович</smev:Name></smev:Originator><smev:TypeCode>OTHR</smev:TypeCode><smev:Status>REQUEST</smev:Status><smev:Date>2018-07-23T15:46:26.7322322+04:00</smev:Date><smev:ExchangeType>3</smev:ExchangeType></smev:Message></S:Body></S:Envelope>

